Revit 2024 API
BuiltInFailures.FamilyFailures.FamilyNoExternalParametersWarning Property
 Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FamilyNoExternalParametersWarning { get; }
Visual Basic
Public Shared ReadOnly Property FamilyNoExternalParametersWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FamilyNoExternalParametersWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace